template/0.orig/include/ABLConditions
/*--------------------------------*- C++ -*----------------------------------*\

ArchiWind by NablaFlow

Initial setup developed for OpenFOAM v2112 by TOH

Todo: 

\*---------------------------------------------------------------------------*/

zDir                 (0 0 1);      
Uref                 5.0;
Zref                 10;           
z0                   uniform 0.03;
d                    uniform 0.0;
flowDir 	     (1.000000 -0.000000 -0.000000);
// ************************************************************************* //
