template/0.orig/include/initialConditions
/*--------------------------------*- C++ -*----------------------------------*\

ArchiWind by NablaFlow

Initial setup developed for OpenFOAM v2112 by TOH

Todo: 
TOH: make variable for flow velocity direction. Must not be zero velocity to form right  

\*---------------------------------------------------------------------------*/



flowVelocity         (0.001 -0.000 0);  
pressure             0;
turbulentKE          1.3;  //TOH: can prob. remove
turbulentEpsilon     0.01; //TOH: can prob. remove

// ************************************************************************* //
