template/0.orig/p
/*--------------------------------*- C++ -*----------------------------------*\

ArchiWind by NablaFlow

Initial setup developed for OpenFOAM v2112 by TOH

Todo: 

\*---------------------------------------------------------------------------*/

FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    object      p;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

#include        "include/initialConditions"

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform $pressure;

boundaryField
{
    sides
    {
        type            freestreamPressure;
        freestreamValue $internalField;
    }
    
    top
    {
        type            slip;
    }
    
    "(terrain|surroundings|building)"
    {
        type            zeroGradient;
    }
   
    "proc.*"
    {
    type            processor;
    }
    
}

// ************************************************************************* //
