template/system/components
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description
    Writes the component scalar fields (e.g. Ux, Uy, Uz) of a field (e.g. U).

\*---------------------------------------------------------------------------*/

type            components;
libs            ("libfieldFunctionObjects.so");

field           U;

executeControl  writeTime;
writeControl    writeTime;

// ************************************************************************* //
