template/system/projectToPatchBuilding2
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  6
     \\/     M anipulation  |
-------------------------------------------------------------------------------
Description

\*---------------------------------------------------------------------------*/

type            projectToPatch;
libs            ("libprojectToPatch.so");

field "mag(U)";
patch building;
height 2.0;

// ************************************************************************* //
