template/system/setFieldsDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      setFieldsDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

defaultFieldValues
(
    //volScalarFieldValue qPlant 0
    volScalarFieldValue plantCd 0
    volScalarFieldValue leafAreaDensity 0
);

regions
(
     cellToCell
    {
        set tree; 
        fieldValues	
        (
         //volScalarFieldValue qPlant 0.0
         volScalarFieldValue plantCd 1.0
         volScalarFieldValue leafAreaDensity 0.8
        );
    }
       
);


// ************************************************************************* //
