template/system/surfacesVelocity
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2012                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

surfacesVelocity
{
    type            surfaces;
    libs            (sampling);
    writeControl    writeTime;

    surfaceFormat   vtk;
    fields          ( U );

    interpolationScheme cellPoint;

    surfaces
    {
        s0
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 1);
                normal  (0 0 1);
            }
            interpolate     true;
        }
        s1
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 1.5);
                normal  (0 0 1);
            }
            interpolate     true;
        }
        s2
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 2);
                normal  (0 0 1);
            }
            interpolate     true;
        }
        s3
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 2.5);
                normal  (0 0 1);
            }
            interpolate     true;
        }
        s4
        {
            type            cuttingPlane;
            planeType       pointAndNormal;
            pointAndNormalDict
            {
                point   (0 0 3.0);
                normal  (0 0 1);
            }
            interpolate     true;
        }
    }
}


// ************************************************************************* //
