template/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
    // tree
    {
        name    tree;
        type    cellSet;
        action  new;
        source  boxToCell;
        sourceInfo
        {
            box_template
        }
    }
    {
        name    tree;
        type    cellZoneSet;
        action  new;
        source  setToCellZone;
        sourceInfo
        {
            set tree;
        }
    }

{
name b0;
type cellSet;
action new;
source boxToCell;
sourceInfo
{
   box   (-135 -135 0) (135 135 65);
}
}


);

// ************************************************************************* //
